# Specify a directory to install

cask_args appdir: '/Applications'

# Taps

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Binaries

brew "cask"
brew "git"
brew "mas"
brew "pandoc"
brew "python"
brew "vim", args: ["with-override-system-vi"]
brew "youtube-dl"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "zsh"
brew "mackup"

# Apps

cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask "caffeine"
cask "mactex"
cask "iterm2"
cask "karabiner-elements"
cask "typora"

# Fonts

cask "font-hack-nerd-font"
