# Specify a directory to install

cask_args appdir: '/Applications'

# Taps

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Binaries

brew "cask"
brew "git"
brew "mas"
brew "pandoc"
brew "python"
brew "vim", args: ["with-override-system-vi"]
brew "youtube-dl"
brew "zsh-syntax-highlighting"
brew "zsh"

# Apps

cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask "caffeine"
cask "mactex"

# Fonts

cask "font-hack-nerd-font"

# Mac App Store

mas "BetterSnapTool", id: 417375580
mas "iMovie", id: 408981434
mas "Install macOS Mojave", id: 0
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Presentation Font Embedder", id: 1032355479
mas "Todoist", id: 585829637
